<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Благотворительность");
?>
<div>
  <br />
</div>

<div>
  <br />
</div>
 В помощь <a title="Отказники" class="button" href="http://www.otkazniki.ru/" target="_blank" ><strong>объединению волонтеров Otkazniki.ru</strong></a>, оказывающих <strong>помощь детям-сиротам</strong>, Mladenec.ru. 11.11.2006 г. создал проект &quot;Благотворительность&quot;. Если Вам небезразлична судьба малышей, Вы можете <strong>пожертвовать средства</strong> одним из следующих способов: 
<br />
 
<ul> 
  <li><strong>Если Вы являетесь клиентом нашего интернет магазина</strong> - возможно добавить товар &quot;благотворительность&quot;, оформляя заказ в Вашей корзине<strong>.</strong></li>
 
  <li>Вы можете указать <strong>любое количество</strong>. <strong>Сумма</strong> средств внесенных на благотворительность <strong>учитывается</strong> при оформлении заказа, <strong>не</strong> <strong>влияет на сумму бесплатной доставки и разовой скидки но учитывается для накопительной скидки</strong> для зарегистрированных пользователей.</li>
 </ul>
 
<br />
 <a href="http://alpha.mladenec-shop.ru/personal/basket.php" >Перейти в корзину, если заказ уже создан</a> 
<br />
 
<br />
 <a href="http://alpha.mladenec-shop.ru/" >Перейти к выбору товарных позиций</a> 
<br />
 
<br />
 
<p>Если <strong>Вы не являетесь клиентом нашего интернет-магазина</strong>, но хотите <strong>помочь детям</strong>, пожертвовать денежные средства возможно при помощи <a class="button" href="http://money.yandex.ru/doc.xml?id=522781" target="_blank" ><strong>платёжной системы Yandex.Деньги</strong></a></p>
 
<br />
 
<ul> 
  <li>Номер кошелька для перевода средств: <strong>41001489607558</strong> </li>
 </ul>
 
<br />
 
<p>Все перечисленные средства пойдут в помощь детям-отказникам, волею судьбы вынужденным проводить свое детство в больницах Москвы и Подмосковья.</p>
 
<p><strong>Формирование заказов для детей-отказников осуществляется по отпускным ценам производителей</strong></p>
 
<p>Наш проект не является коммерческим и не финансируется государственными или какими-либо другими организациями. 
  <br />
 </p>
 
<p>В основу фонда финансовой помощи детям легли собственные средства интернет-магазина Mladenec.ru. С каждого заказа, сделанного в нашем интернет-магазине, фонд &quot;Благотворительность&quot; будет пополняться на сумму 10 рублей. 
  <br />
 
  <br />
 Мы ждем всех людей доброй воли, готовых вместе с нами участвовать в решении этой нелегкой задачи!</p>
 
<br />
 
<p class="summaotkazniki">БЛАГОДАРЯ ВАМ, НА СЕГОДНЯ СОБРАНО СРЕДСТВ НА СУММУ (отчеты о расходовании средств будут опубликованы на этой <a target="_blank" href="/about/Blagotvoritelnost/otchet.php" id="Отчет" title="Отчет" ><span class="undefined">странице</span></a>) </p>
 
<p><strong>Собрано <u>1 713 924 </u></strong><strong><u>рублей. </u></strong></p>
 
<p><u><strong>Израсходовано </strong></u><u><strong><u>1 564 520 </u></strong></u><u><strong>рублей. </strong></u></p>
 
<p><u><strong>В наличии 49 404 рублей.</strong></u></p>
 
<br />
 <?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>