<div id="simple">
    <h1>Страница не найдена (ошибка 404)</h1>

	<p>Здравствуйте, уважаемый посетитель.</p> 
	<p>К&nbsp;сожалению, запрашиваемой Вами страницы не&nbsp;существует на&nbsp;нашем сайте.</p> 
	<p>Возможно, это случилось по&nbsp;одной из&nbsp;этих причин:</p> 
	<ul> 
		<li>Вы&nbsp;ошиблись при наборе адреса страницы (URL)</li> 
		<li>перешли по&nbsp;«битой» (неработающей, неправильной) ссылке</li>

		<li>запрашиваемой страницы никогда не&nbsp;было на&nbsp;сайте или она была удалена</li> 
	</ul> 
	<p>Мы&nbsp;просим прощения за&nbsp;доставленные неудобства и&nbsp;предлагаем следующие пути:</p> 
	<ul> 
		<li>вернуться назад при помощи кнопки браузера</li>
		<li>проверить правильность написания адреса страницы (URL)</li> 
		<li>перейти на&nbsp;<a href="/">главную страницу сайта</a></li> 
		<li>воспользоваться меню разделов сайта</li>
	</ul> 

	<p>Если Вы&nbsp;уверены в&nbsp;правильности набранного адреса страницы и&nbsp;считаете, что эта ошибка произошла по&nbsp;нашей вине, 
	пожалуйста, сообщите об&nbsp;этом разработчикам (или владельцам) сайта при помощи электронной почты.</p> 
</div>
