<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Доставка");
?> 
<p><strong>Приветствуем Вас</strong>, на нашем сайте. Перед тем, как Вы будете совершать покупку в нашем интернет-магазине, убедительно просим Вас ознакомиться с режимом и правилами работы магазина и условиями доставки Вашего заказа.</p>
 
<br />
 <a href="&#35;Доставка по Москве">Доставка по Москве </a> 
<br />
 <a href="&#35;Доставка за МКАД">Доставка за МКАД </a> 
<br />
 <a href="&#35;Срочная доставка">Срочная доставка </a> 
<br />
 <a href="&#35;Самовывоз">Самовывоз </a> 
<br />
 <a href="&#35;Доставка по России">Доставка по России </a> <a href="&#35;Оплата"> 
  <br />
 </a> 
<h2><a name="Доставка по Москве"></a>Доставка по Москве</h2>
 
<p><strong>Срок исполнения заказа</strong> в этот или на следующий день (в зависимости от времени поступления заказа). При заказе до 12 часов доставка заказа осуществляется в этот же день на стандартных условиях (при максимальной загрузке службы доставки - возможен перенос на следующий день). 
  <br />
 Также Вы можете указать любой другой удобный для Вас день доставки. 
  <br />
 При согласовании времени доставки, <b>Вы можете выбрать любой 4-х часовой промежуток времени в диапазоне с 14 до 22 ч. (14-18, 15-19, 16-20, 17-21, 18-22)</b> или <b>вечернюю доставку 20-22, 21-23 за дополнительную плату</b>. 
  <br />
 Более точное время получения заказа Вы может узнать после 13 часов текущего дня доставки.</p>
 
<p><strong>Стоимость доставки</strong> по г. Москве в пределах МКАД: 
  <br />
 До 500 р. - доставка 350 р. 
  <br />
 От 500 р. - доставка 250 р. 
  <br />
 От 1000 р. - 100 р. 
  <br />
 <strong>От 1500 р. - БЕСПЛАТНО</strong> 
  <br />
 При оформлении заказа Вы можете бесплатно заказать услугу Уведомить за 10/20/30 мин.</p>
 
<p>После фактического формирования заказа, с Вами свяжется менеджер для подтверждения доставки.</p>
 
<p>В случае невозможности доставки заказа  в оговоренное время по независящим от Интернет-магазина обстоятельствам (ограничения движения по городу, автомобильные пробки, поломка автомобиля на маршруте и т.п.), Интернет-магазин уведомляет об этом покупателя и согласовывает время доставки на более поздний срок в текущий или другой день.</p>
 
<p>В случае невозможности принять заказ (в оговоренное с оператором время), покупатель обязан уведомить об этом Интернет-магазин не менее чем за 2 часа до времени доставки. В ином случае, стоимость повторной доставки 195 рублей.</p>
 
<p>На любой приобретенный у нас товар Вы получаете товарный или кассовый чек, который подтверждает покупку данного товара в нашем магазине. Если Вам необходимы дополнительные или особые платежные документы, сообщите об этом при заказе или менеджеру при подтверждении заказа. Вместе с покупкой товара в нашем интернет-магазине Вы получите гарантийный талон нашего магазина (кроме товара не имеющего гарантийных обязательств) или фирменный гарантийный талон, дающий право на бесплатный ремонт товара в случае брака в течение гарантийного срока в любом авторизованном сервисном центре производителя.</p>
 
<h2><a name="Доставка за МКАД"></a>Доставка за МКАД<strong></strong></h2>
 Осуществляется на тех же условиях что и по Москве за исключением стоимости доставки. Ограничения по времени  принимаются при возможности и индивидуально. 
<p><strong>Стоимость доставки</strong>: 15/20 рублей - каждый полный и неполный километр от МКАД (в зависимости от суммы заказа). </p>
 
<h2><a name="Срочная доставка"></a>Cрочная доставка</h2>
 
<p><strong>Срочная доставка в течение 3-4-х часов</strong>. Стоимость доставки <strong>400-1000 рублей</strong> (в зависимости от удаленности адреса клиента от  склада). Возможность оказания услуги уточняйте у менеджера. Доставка заказа осуществляется с <strong>14:00 до 22:00</strong> (ограничения по времени принимаются в течении любых 4-х часов в вышеуказанном диапазоне).</p>
 
<p><strong>Срочная доставка за МКАД</strong>: Ограничения по времени  принимаются при возможности и индивидуально.</p>
 
<h2><a name="Самовывоз"></a>Самовывоз</h2>
 
<p>Если Вам удобно самостоятельно забрать заказ, Вы можете выбрать этот способ доставки. Сформированный заказ Вы можете осмотреть и оплатить в наших <a target="_blank" href="/help/setevoi magazin.php">сетевых магазинах</a>:</p>
 
<p><strong>М.О. г. Мытищи, ул.Шараповская, д.1 корп.2</strong> Тел.8-495-972-22-11<a title="карта проезда" target="_blank" href="/images/korolevi_fasad_02new.jpg"><strong></strong></a></p>
 
<p><strong>М.О. г. Королев ул.Декабристов, д.20</strong> Тел<b>.</b> 8-495-519-53-24</p>
 
<p><strong>М.О. г. Юбилейный, ул.Лесная, д.14</strong> Тел. 8-495-515-93-80</p>
 
<p><strong>Режим работы магазинов:</strong> Каждый день без выходных, с 10.00 до 20.30.</p>
 
<p>Разместив заказ на сайте или оформив его по телефону, уточните наличие заказа, перед тем, как Вы решили подъехать к нам в магазин.</p>
 
<h2><a name="Доставка по России"></a>Доставка в города и регионы России</h2>
 
<p>После фактического формирования заказа интернет-магазином Младенец.ру, покупателю высылается на е-мейл копия счета и квитанция для оплаты в банке. 
  <br />
 Время формирования заказа составляет 1-3 дня. 
  <br />
 Сумма заказа должна составлять более <strong>2500 руб.</strong></p>
 
<p>Стоимость доставки до места назначения Вы можете рассчитать, выбрав услуги любой транспортной компании из нашего Списка:<strong></strong> 
  <br />
 1. <a target="_blank" href="http://www.gruzovozoff.ru/rus/rates.php">ГРУЗОВОЗОФФ</a> 
  <br />
 2. <a href="http://www.baikalsr.ru/" target="_blank">Байкал-Сервис</a> 
  <br />
 3. <a target="_blank" href="http://www.jde.ru/services/calculator.html">ЖелДорЭкспедиция</a> 
  <br />
 4. <a href="http://www.tcnms.ru/tarifi.php" target="_blank">ВСТ</a> 
  <br />
 5. <a href="http://www.pecom.ru/ru/" target="_blank">Первая Экспедиционная Компания </a></p>
 
<p>Если Вы желаете, чтобы доставку осуществила грузовая компания, не входящая в перечень стандартных, укажите, пожалуйста, название и контактные данные компании в Москве в примечании к Вашему заказу. Если условия отправки груза будут приемлемы для нашего магазина, мы с удовольствием отправим Ваш заказ выбранной Вами компанией.</p>
 <i> </i> 
<p> <strong>Почтовыми компаниями отправка не осуществляется.</strong> 
  <br />
 Оплата  транспортной компании за доставку осуществляется при получении заказа по её тарифам.</p>
 
<p>Просим оплатить заказ в течение 5-х банковских дней. В ином случае наличие заказанных товаров на складе не гарантируется. 
  <br />
 </p>
 
<p><b></b>Отправка Вашего заказа до транспортной компании осуществляется в течение 3-х дней после поступления оплаты на наш расчетный счет. После доставки заказа в транспортную компанию на адрес Вашей электронной почты придет номер накладной на отправку.</p>
 
<p><b>ВНИМАНИЕ</b>: в компанию ГРУЗОВОЗОФФ оплаченные заказы будут отгружаться только по субботам (данная мера связана с большой загрузкой компании в будние дни).</p>
 <?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>