<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Оплата");
?> 
<h2><font color="&#35;ff6600">Наличный расчет</font></h2>
 Оплата производится наличными курьеру при доставке заказа (по Москве и Подмосковью). Оплата принимается в российских рублях,  строго в соответствии с ценой указанной в товарном чеке. 
<br />
 
<h2><font color="&#35;ff6600">Безналичный расчет</font></h2>
 Интернет-магазин Младенец.РУ принимает безналичную оплату от физических. После получения заказа интернет-магазином и его фактическим формированием, высылается счет и квитанция на оплату по электронной почте, которые Вы можете оплатить в любом отделении Сбербанка РФ или других банках, оказывающих такие услуги. После поступления на расчетный счет Младенец.Ру мы осуществляем отправку Вашего заказа по указанному адресу. 
<br />
 
<br />
 
<h2> <font color="&#35;ff6600">Платежная система Yandeх-Деньги</font></h2>
 Для оплаты заказа Вы можете использовать платежную систему Яндекс.Деньги - доступный и безопасный способ платить за товары и услуги через Интернет. Для открытия счета в системе Яндекс.Деньги достаточно зарегистрироваться на сайте. Следующий шаг - внесение денег на счет. Это можно сделать через терминалы, системы денежных переводов, предоплаченные карты, а также банки (в том числе банковские карты) во всех регионах России. Деньги со счета можно в любой момент использовать для расчетов за услуги и покупки через Интернет. Платежи в интернет-магазин Яндекс.Деньгами - мгновенные, без комиссии.  
<br />
 Номер кошелька для перевода оплаты: <strong>41001489607558.</strong> 
<br />
 
<br />
 
<br />
 
<br />
 
<br />
 <?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>