<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Контакты");
?> 
<h2><font color="&#35;ff6600">Режим работы
    <br />
  </font></h2>
 <b>Оформить заказ</b> на сайте Младенец.РУ Вы можете <b>круглосуточно</b>. 
<br />
 
<br />
 <b>Прием заказов по телефону</b> 8 (495) 662-999-4: 
<br />
 
<br />
 С понедельника по субботу с 9.00 до 22.00 
<br />
 В воскресенье с 10.00 до 21.00. 
<br />
 
<br />
 <b>Служба доставки работает:</b> 
<br />
 С понедельника по воскресенье с 14.00 до 22.00. 
<br />
 <?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>