<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("О регистрации");
?>
<h4>Как и зачем это нужно делать?</h4>

<p>Регистрация не является обязательной для посетителей нашего интернет-магазина, но необходима при заказе товаров и, создает дополнительные удобства для Вас при просмотре информации на сайте и оформлении заказа при совершении покупки.</p>

<p>Вы можете зарегистрироваться в любое время, а предоставленная Вами информация будет храниться до тех пор, пока Вы не изъявите желание ее удалить или исправить. </p>
<?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>