<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Пользовательское соглашение");
?> 
<p align="center" style="margin-bottom: 0.0001pt;" class="MsoNormal"><b><font size="4">Пользовательское Соглашение</font></b><o:p></o:p></p>
 
<p class="MsoNormal">Интернет-магазин &laquo;Младенец.ру&raquo; осуществляет свою работу в соответствии с действующими законодательством РФ, регулирующим права потребителей и правила торговли, и предлагает Вам свои услуги электронного магазина детских товаров на условиях, являющихся предметом настоящего Соглашения.<o:p></o:p></p>
 
<p class="MsoListParagraphCxSpFirst"> </p>
 
<ul> 
  <li><b><a href="#Термины" >Термины и определения настоящего Соглашения</a></b></li>
 
  <li><b><a href="#Общие положения" >Общие положения</a></b></li>
 
  <li><b><a href="#Предмет соглашения" >Предмет Соглашения</a></b></li>
 
  <li><b><a href="#Оформление заказа" >Оформление Заказа</a></b></li>
 
  <li><b><a href="#Качество и упаковка" >Качество и упаковка Товара</a></b></li>
 
  <li><b><a href="#Условия доставки" >Условия доставки Товаров</a></b></li>
 
  <li><b><a href="#Условия и способы оплаты" >Условия и способы оплаты</a></b></li>
 
  <li><b><a href="#Порядок возврата и обмена" >Порядок возврата и обмена купленного Товара</a></b></li>
 
  <li><b><a href="#Конфиденциальность" >Конфиденциальность и безопасность</a></b></li>
 
  <li><b><a href="#Обстоятельства" >Обстоятельства непреодолимой силы</a></b></li>
 
  <li><b><a href="#Прочие условия" >Прочие условия</a></b></li>
 
  <li><b><a href="#Законодательство" >Законодательство</a></b></li>
 </ul>
 
<p></p>
 
<p class="MsoNormal"><b><a href="#Термины" > 
<a name="Термины"></a>
 </a></b><b>Термины и определения настоящего Соглашения</b><span lang="EN-US"><o:p></o:p></span></p>
 
<p class="MsoNormal"><b>Покупатель:</b> лицо, совершившее акцепт Соглашения.<o:p></o:p></p>
 
<p class="MsoNormal"><b>Продавец:</b> Общество с ограниченной ответственностью &laquo;ТД Младенец.ру&raquo; (Интернет-магазин).<o:p></o:p></p>
 
<p class="MsoNormal">Продавец и Покупатель совместно именуются Стороны, а каждый по отдельности &mdash; Сторона.<o:p></o:p></p>
 
<p class="MsoNormal"><b>Сайт:</b> веб-сайт Интернет-магазина &laquo;Младенец.ру&raquo;, находящийся по адресу: <a href="http://www.mladenec-shop.ru/" >http://www.mladenec.ru/</a>, а также вся доступная Пользователю (Покупателю) совокупность веб-страниц и сервисов, относящихся к этому адресу.<o:p></o:p></p>
 
<p class="MsoNormal"><b>Товар</b> &mdash; объект купли-продажи (вещь), представленный к продаже в Интернет-магазине, посредством размещения в соответствующем разделе Интернет-магазина.<o:p></o:p></p>
 
<p class="MsoNormal"><b>Заказ</b> &mdash; запрос Покупателя на покупку и доставку по указанному в запросе адресу Товаров, выбранных в Интернет-магазине, отправленный посредством сети Интернет и/или сообщенный Покупателем Продавцу по телефону, указанному на Сайте.<o:p></o:p></p>
 
<br />
 
<p class="MsoNormal"> 
<a name="Общие положения"></a>
 <b>1. Общие положения</b><o:p></o:p></p>
 
<p align="justify" class="MsoNormal">1.1. Настоящее Пользовательское Соглашение (далее &ndash; Соглашение) вступает в силу с момента отправки Покупателю от Продавца (далее &ndash; Интернет-магазин &laquo;Младенец.ру&raquo;, Интернет-магазин) электронного подтверждения о принятии Заказа или получения от Покупателя Заказа по телефону. <o:p></o:p></p>
 
<p align="justify" class="MsoNormal">1.2. Покупатель гарантирует, что приобретенные Товары будут использованы им в личных, семейных и иных аналогичных целях, не связанных с предпринимательской деятельностью.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">1.3. Каждая Сторона гарантирует другой Стороне, что обладает необходимыми право- и дееспособностью, а равно всеми правами и полномочиями, необходимыми и достаточными для заключения Соглашения  и исполнения всех его условий.<o:p></o:p></p>
 
<br />
 
<p class="MsoNormal"> 
<a name="Предмет соглашения"></a>
 <b>2. Предмет Соглашения</b><o:p></o:p></p>
 
<p align="justify" class="MsoNormal">2.1. Продавец, обязуется передать покупателю Товар, предназначенный для личного, семейного, домашнего или иного использования, не связанного с предпринимательской деятельностью; а Покупатель обязуется принять и оплатить данный Товар.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">2.2. Точное наименование и количество Товара указываются в товарном чеке, передаваемом Продавцом Покупателю.<o:p></o:p></p>
 
<br />
 
<p class="MsoNormal"> 
<a name="Оформление заказа"></a>
 <b>3. Оформление Заказа</b><o:p></o:p></p>
 
<p align="justify" class="MsoNormal">3.1. Для осуществления предварительного Заказа Покупатель должен предоставить Продавцу правдивую, точную и полную информацию об адресе, по которому должен быть  доставлен Товар; контактные телефоны и адрес электронной почты Покупателя. <o:p></o:p></p>
 
<p align="justify" class="MsoNormal">3.2. После получения Заказа Продавцом, Покупателю автоматически высылает дубликат Заказа на электронный адрес (в текстовой кодировке Windows кириллица). Далее сотрудник Интернет-магазина &laquo;Младенец.ру&raquo; связывается с Покупателем по указанным контактным телефонам для подтверждения Заказа, уточнения времени доставки и проверки адреса, по которому будет осуществляться доставка Товара.  <o:p></o:p></p>
 
<p align="justify" class="MsoNormal">3.3. При отправке Заказа Товара в ночное время или в праздничные дни, Заказ считается полученным Продавцом в 10 часов утра следующего рабочего дня.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">3.4. Предварительный Заказ Товара считается принятым Продавцом   с момента отправки Продавцом электронного подтверждения о принятии Заказа  Покупателю, либо  с момента подтверждения Продавцом по телефону принятия  Заказа от Покупателя. <o:p></o:p></p>
 
<p align="justify" class="MsoNormal">3.5. Продавец не несет ответственности за неполучение Покупателем электронного уведомления о принятии Заказа на электронный адрес по причинам, связанным с перебоями работы сети &laquo;Интернет&raquo;, а также по другим, независящим от Продавца причинам.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">3.6. В случае если сотрудник Интернет-магазина &laquo;Младенец.ру&raquo; не связался с Покупателем по телефону в течение 2-х часов, Покупателю необходимо самому связаться с Интернет-магазином &laquo;Младенец.ру&raquo; по телефонам, указанным на Сайте. <o:p></o:p></p>
 
<p align="justify" class="MsoNormal">3.7. В случае если Покупатель осуществил Заказ Товара, которого  нет в наличии Интернет-магазине &laquo;Младенец.ру&raquo;, Покупатель имеет право зарезервировать данный Товар до нового поступления этого Товара, либо заказать имеющийся в наличии Товар, аналогичный отсутствующему.<o:p></o:p></p>
 
<p class="MsoNormal"> 
  <br />
 </p>
 
<p class="MsoNormal"> 
<a name="Качество и упаковка"></a>
 <b>4. Качество и упаковка Товара</b><o:p></o:p></p>
 
<p align="justify" class="MsoNormal">4.1. Продавец гарантирует Покупателю, что качество Товара, приобретаемого Покупателем  в Интернет-магазине &laquo;Младенец.ру&raquo; соответствует всем обязательным требованиям и стандартам, предусмотренным законодательством РФ.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">4.2. Доставляемый Покупателю Товар упакован в картонные короба (ящики) или полиэтиленовые пакеты. Продавец гарантирует Покупателю, что упаковка и маркировка Товара, передаваемого Покупателю, соответствует всем обязательным требованиям и стандартам, предусмотренным законодательством РФ для данного вида Товаров.<o:p></o:p></p>
 
<p class="MsoNormal"> 
  <br />
 </p>
 
<p class="MsoNormal"> 
<a name="Условия доставки"></a>
 <b>5. Условия доставки Товаров</b><o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.1. Время работы службы доставки Интернет-магазина &laquo;Младенец.ру&raquo;:  ежедневно, с 14 часов до 23 часов.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.2. Точное время доставки Товара Покупателю предварительно согласуется Сторонами по телефону.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.3. В случае отсутствия возможности доставки Заказа в сроки, указанные Покупателем, Интернет-магазин &laquo;Младенец.ру&raquo; вправе перенести Заказ на другое согласованное Сторонами время доставки, либо отказаться от нее в одностороннем порядке.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.4. Доставка Товара осуществляется автомобильным транспортом до подъезда Покупателя. Далее доставка Товара осуществляется курьером Интернет-магазина  &laquo;Младенец.ру&raquo; до квартиры Покупателя.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.5. В случае невозможности подъезда  автотранспорта к дому Покупателя  Продавец вправе в одностороннем порядке  отказаться от доставки Заказа, либо осуществить такую доставку за дополнительную плату.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.6. Время нахождения курьера по адресу Покупателя ограничено 12 минутами.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.7. При невозможности воспользоваться лифтом для доставки Товара, стоимость подъема габаритного или тяжелого Заказа:<o:p></o:p></p>
 
<p style="margin-bottom: 0.0001pt;" class="MsoNormal"><span style="background-color: white;">От 10 кг - 30 рублей этаж</span></p>
 
<p style="margin-bottom: 0.0001pt;" class="MsoNormal">От 40 кг - 60 рублей этаж</p>
 
<p style="margin-bottom: 0.0001pt;" class="MsoNormal"> От 60 кг - 90 рублей этаж</p>
 
<p style="margin-bottom: 0.0001pt;" class="MsoNormal">От 80 кг - 120 рублей этаж</p>
 
<p style="margin-bottom: 0.0001pt;" class="MsoNormal">От 100 кг - 150 рублей этаж<o:p></o:p></p>
 
<p class="MsoNormal">до 10 кг - бесплатный подъем до 5 этажа.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.8. В случае, предусмотренном п. 5.7. Соглашения Продавец имеет право в одностороннем порядке изменить стоимость доставки, либо отказаться от осуществления доставки Товара Покупателю с последующем уведомлением его об этом.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.9. Покупатель может воспользоваться услугой  &laquo;Уведомление за 30 минут до доставки Товара&raquo;. Если сотрудник Интернет-магазина &laquo;Младенец.ру&raquo; не дозвонился до Покупателя за 30 (тридцать) минут до прибытия курьера, то Заказ считается перенесенным на неопределенный срок до согласования нового времени доставки Заказа Сторонами.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.10. Курьер обязан передать Товар, соответствующий предварительному Заказу Покупателя; требованиям к качеству Товара, предусмотренным п. 4.1. Соглашения; а также надлежащим образом упакованный и промаркированный в соответствии с п. 4.2. Соглашения.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.11. Курьер обязан одновременно с передачей Товара передать его принадлежности, и товарный чек; а также прилагаемые к Товару инструкцию и гарантийный талон (в случае предоставления их производителем).<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.12. Все остальные документы предоставляются Продавцом по предварительной заявке Покупателя.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.13. Обязанность Продавца передать Товар Покупателю считается исполненной в момент вручения курьером Товара Покупателю или указанному Покупателем лицу, способному принять и оплатить Товар.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.14. Покупатель гарантирует осуществление приемки и оплаты Товара по указанному адресу в согласованное Сторонами время  лично, либо указанным Покупателем лицом.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.15. Право собственности на Товар и риск случайной гибели Товара переходит от Продавца к Покупателю в момент оплаты Товара. <o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.16. Факт оплаты Товара Покупателем курьер фиксирует в &laquo;Бланке доставки Товаров&raquo;.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.17. В случае отсутствия Покупателя или указанного Покупателем лица по указанному в заявке адресу в согласованное Сторонами время, Продавец вправе в одностороннем порядке отказаться от доставки.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.18. Стоимость доставки указана в разделе &laquo;<a href="http://www.mladenec-shop.ru/delivery/" >Доставка</a>&raquo;.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.19. За дополнительный приезд курьера с Покупателя взимается 195 (сто девяносто пять) рублей. <o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.20. Доставка за пределы МКАД: 15/20 рублей - каждый полный и неполный километр от МКАД (в зависимости от суммы Заказа) дополнительно к стоимости доставки в пределах МКАД. Доставка за МКАД осуществляется без ограничения по времени. Условия доставки могут меняться в зависимости от ситуации на дорогах Москвы.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.21. При принятии Заказа от курьера, Покупатель обязан осмотреть доставленный Заказ и проверить его на соответствие заявленному количеству, ассортименту и комплектности Товара, а также проверить срок годности доставленного Товара и целостность упаковки. В случае отсутствия претензий, Покупатель расписывается в &laquo;Бланке доставки Заказов&raquo; и оплачивает Заказ. Подпись в доставочных документах свидетельствует, о том, что претензий Покупателем не заявлено и Продавец полностью и надлежащим образом выполнил свою обязанность по передаче Товара.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.22. В случае возникновения у Покупателя претензий при получении Заказа, Покупатель имеет право отказаться от получения Товара. В таком случае курьер обязан описать все выявленные нарушения, и отразить их в Акте. Акт составляется в 3-х (трех) экземплярах, в которых Покупатель расписывается в отказе от получения Товара или излагает требования о замене Товара. В случае отказа Покупателя от подписания Акта, курьер делает об этом отметку в Акте. После составления Акта курьер забирает Товар для последующего возврата его в Интернет-магазин &laquo;Младенец.ру&raquo; или для замены его на другой Товар. Доставка замененного Товара осуществляется в иное время по договоренности Сторон.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">5.23. В случае невозможности доставки Товара Продавцом по причине затруднений в движении автотранспорта на дорогах, поломки автотранспорта, отсутствие технической возможности и других случаях, Продавец вправе согласовать с Покупателем иное время доставки Товара, либо отказаться от доставки Товара в одностороннем порядке с последующим уведомлением об этом Покупателя.</p>
 
<p class="MsoNormal"> 
  <br />
 </p>
 
<p class="MsoNormal"> 
<a name="Условия и способы оплаты"></a>
 <b>6. Условия и способы оплаты</b><o:p></o:p></p>
 
<p align="justify" class="MsoNormal">6.1. Стоимость Товара указывается в товарном чеке, предаваемом Продавцом Покупателю.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">6.2. Покупатель оплачивает Товар Продавцу одним из следующих способов по выбору Покупателя: <o:p></o:p></p>
 
<p align="justify" class="MsoNormal">6.2.1. Путем наличного расчета с курьером при доставке Товара.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">6.2.2. Путем перевода денежных средств на расчетный счет Покупателя. В этом случае датой оплаты Товара считается день поступления денежных средств на  расчетный счет Продавца.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">Данный способ оплаты возможен как для физических, так и для юридических лиц. Номер расчетного счета указывается в счете на оплату, высылаемом Продавцом Покупателю после принятия Продавцом Заказа Покупателя.            <o:p></o:p></p>
 
<p align="justify" class="MsoNormal">6.2.3. Путем оплаты Товара при помощи платёжной системы Yandex.Деньги.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">В этом случае датой оплаты Товара считается день поступления денежных средств на закрепленный за Продавцом  виртуальный счет системы Yandex.Деньги.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">Номер кошелька для перевода денежных средств: 410011347840918<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">6.3. Все расчеты между Сторонами осуществляются в рублях.<o:p></o:p></p>
 
<br />
 
<p class="MsoNormal"> 
<a name="Порядок возврата и обмена"></a>
 <b>7. Порядок возврата и обмена купленного Товара</b><o:p></o:p></p>
 
<p align="justify" class="MsoNormal">7.1. Обмен и возврат Товара осуществляется в соответствии с действующим законодательством РФ.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">7.2. Выезд курьера Интернет-магазина &laquo;Младенец.ру&raquo; для обмена Товара осуществляется в соответствии с тарифами курьерской службы.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">7.3. Обмен Товара в офисе магазина &laquo;Младенец.ру&raquo; осуществляется бесплатно по предварительной договоренности. Офис расположен по адресу: г. Мытищи, ул. Шараповская, д.1. к.2.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">7.4. Покупатель может осуществить обмен Товара в офисе магазина &laquo;Младенец.ру&raquo; с понедельника по воскресенье включительно с 10.00 до 17.00 часов.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">7.5. При обмене Товара Покупатель должен представить Продавцу документы, подтверждающие факт оплаты Товара.  <o:p></o:p></p>
 
<p align="justify" class="MsoNormal">7.6. В случае отсутствия документов, подтверждающих покупку Товара в Интернет-магазине &laquo;Младенец.ру&raquo; Покупатель должен доказать этот факт самостоятельно.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">7.7. Обмен и возврат Товара надлежащего качества:<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">7.7.1. Покупатель вправе обменять в течение 14 дней непродовольственный товар надлежащего качества на аналогичный товар, если указанный товар не подошел по форме, габаритам, фасону, расцветке, размеру или комплектации. Покупатель также может отказаться от товара до его поставки или в момент фактического его получения, а также имеет право вернуть не подошедший ему товар в течение 7 дней после покупки.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">7.7.2. Обмен и возврат Товара надлежащего качества производится при соблюдении всех следующих условий в совокупности:</p>
 
<p align="justify" class="MsoNormal">Если указанный товар не был в употреблении, сохранены его товарный вид, потребительские свойства; Сохранены фабричные ярлыки (в т.ч. гарантийные талоны, техническая документация, комплектующие детали); Покупатель может предъявить документы, подтверждающие факт и условия покупки указанного Товара либо доказать факт оплаты Товара иным способом (ст. 25 Закона РФ &lt;&lt;О защите прав потребителей&gt;&gt;); Товар не включен в <a href="http://ozpp.ru/laws2/pravila-prod/tovar21.html" target="_blank" >переченьТоваров надлежащего качества</a>, не подлежащих возврату.</p>

<div align="justify"> 7.7.3.  В случае нежелания Покупателя обменять не подошедший ему Товар на аналогичный, Продавец  в течение трех рабочих дней с момента получения такого Товара и письменного заявления Покупателя (содержащего сведения, указанные в п. 7.7.4. Соглашения), осуществляет возврат уплаченной Покупателем за Товар суммы (за исключением расходов  по доставке Товара Продавцом для продажи Покупателю, а также расходов по доставке Товара для возврата от Покупателя Продавцу). 
  <br />
</div>
 
<p align="justify" class="MsoNormal"><o:p></o:p></p>
 
<p align="justify" class="MsoNormal">7.7.4. Заявление о возврате уплаченных денежных средств должно содержать:</p>
 
<p class="MsoNormal"> </p>
 
<ul> 
  <li>фамилию, имя и отчество Покупателя,</li>
 
  <li>паспортные данные Покупателя,</li>
 
  <li>номер Заказа,</li>
 
  <li>наименования возвращаемого Товара,</li>
 
  <li>основания возврата Товара,</li>
 
  <li>причины отказа Покупателя от Товара,</li>
 
  <li>перечисление документов или иных доказательств, подтверждающих факт совершения покупки в Интернет-магазине &laquo;Младенец.ру&raquo;.</li>
 </ul>
 
<p></p>
 
<p style="margin-left: 35.45pt;" class="MsoListParagraphCxSpLast"><o:p></o:p></p>
 
<p align="justify" class="MsoNormal">7.7.5. На основании &laquo;<a href="http://ozpp.ru/laws2/pravila-prod/tovar21.html" >Перечня непродовольственных Товаров надлежащего качества, не подлежащих возврату или обмену на аналогичный Товар других размера, формы, габарита, фасона, расцветки  или комплектации</a>&raquo;, утвержденного Постановлением Правительства РФ от 19 января 1998 года №55, не подлежат возврату следующие Товары надлежащего качества:<o:p></o:p></p>
 
<p class="MsoListParagraphCxSpFirst"> </p>
 
<ul> 
  <li>
    <div align="justify">Товары для профилактики и лечения заболеваний в домашних условиях (предметы санитарии и гигиены из металла, резины, текстиля и других материалов, инструменты, приборы и аппаратура медицинские, средства гигиены полости рта, линзы очковые, предметы по уходу за детьми), лекарственные препараты.</div>
  </li>
 
  <li>
    <div align="justify">Предметы личной гигиены (зубные щетки, расчески, заколки, бигуди для волос, парики, шиньоны и другие аналогичные Товары);</div>
  </li>
 
  <li>
    <div align="justify">Парфюмерно-косметические Товары<span lang="EN-US">.</span></div>
  </li>
 
  <li>
    <div align="justify">Текстильные Товары (хлопчатобумажные, льняные, шелковые, шерстяные и синтетические ткани, Товары из нетканых материалов типа тканей - ленты, тесьма, кружево и другие);</div>
  </li>
 
  <li>
    <div align="justify">Швейные и трикотажные изделия (изделия швейные и трикотажные бельевые, изделия чулочно-носочные);</div>
  </li>
 
  <li>
    <div align="justify">Изделия и материалы, контактирующие с пищевыми продуктами, из полимерных материалов, в том числе для разового использования (посуда и принадлежности столовые и кухонные, емкости и упаковочные материалы для хранения и транспортирования пищевых продуктов) Товары бытовой химии;</div>
  </li>
 
  <li>
    <div align="justify">Мебель бытовая;</div>
  </li>
 
  <li>
    <div align="justify">Технически сложные Товары бытового назначения, на которые установлены гарантийные сроки (бытовая радиоэлектронная аппаратура; электромузыкальные инструменты; игрушки электронные);</div>
  </li>
 
  <li>
    <div align="justify">Другие Товары, входящие в вышеуказанный Перечень.</div>
  </li>
 </ul>

<div align="justify"> 7.8. Обмен и возврат Товара ненадлежащего качества: 
  <br />
</div>
 
<p align="justify" class="MsoNormal"><o:p></o:p></p>
 
<p align="justify" class="MsoNormal">7.8.1. В случае, если Покупатель обнаружили заводской недостаток в купленном в Интернет-магазине &laquo;Младенец.ру&raquo; этот Товар подлежит замене Продавцом в течение 7 дней с момента предъявления Покупателем требования о замене Товара.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">7.8.2. Если для признания качества Товара ненадлежащим требуется экспертиза, то срок обмена Товара может быть увеличен до 20 дней. А при отсутствии Товара на складе Интернет-магазина &ndash; до 30 дней с момента предъявления указанного требования.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">7.8.3. Для осуществления возврата Товара, необходимо составить письменную претензию к качеству Товара (Заявление о возврате уплаченных денежных средств) с указанием: <o:p></o:p></p>
 
<p class="MsoListParagraphCxSpFirst"> </p>
 
<ul> 
  <li>фамилии, имени и отчества Покупателя;</li>
 
  <li>паспортных данных Покупателя;</li>
 
  <li>номера Заказа;</li>
 
  <li>наименования возвращаемого Товара;</li>
 
  <li>основания возврата Товара;</li>
 
  <li>причины отказа Покупателя от Товара;</li>
 
  <li>перечисления документов или иных доказательств, подтверждающих факт совершения покупки в Интернет-магазине &laquo;Младенец.ру&raquo;.</li>
 </ul>

<div align="justify"> 7.8.4. Решение о возврате уплаченных сумм производиться только при наличии письменной претензии к качеству Товара (Заявление о возврате уплаченных денежных средств), содержащей сведения, предусмотренные п.7.8.3 Соглашения. 
  <br />
</div>
 
<p align="justify" class="MsoNormal"><o:p></o:p></p>
 
<p align="justify" class="MsoNormal"> 7.8.5. Возврат суммы, уплаченной Покупателем за Товар ненадлежащего качества, осуществляется в течение 10 рабочих дней с момента получения Продавцом Товара ненадлежащего качества и письменной претензии от Покупателя. Для ускорения процесса возврата &ndash; рекомендуем выслать указанную претензию по электронной почте на электронный адрес <a href="mailto:offer@mladenec.ru" >offer@mladenec.ru</a>. <o:p></o:p></p>
 
<p align="justify" class="MsoNormal"> 7.8.6. Продавец не несет ответственности за возможный отказ и/или уклонение от гарантийных обязательств фирмы-изготовителя.<o:p></o:p></p>
 
<br />
 
<p class="MsoNormal"> 
<a name="Конфиденциальность"></a>
 <b>8. Конфиденциальность и безопасность</b><o:p></o:p></p>
 
<p align="justify" class="MsoNormal">8.1. Стороны обязуются принимать все необходимые меры по безопасности и защите информации и документов, обмен которыми был осуществлен между Сторонами, или которые стали доступны Сторонам при исполнении настоящего Соглашения.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">8.2. Покупатель обязуется самостоятельно принимать все необходимые меры по сохранению конфиденциальности, предотвращению несанкционированного использования и защите аутентификационных данных от несанкционированного доступа со стороны третьих лиц.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">8.3. Продавец обязуется соблюдать конфиденциальность в отношении персональных данных Покупателя, а также иной информации о Покупателе, ставшей известной Продавцу в связи с исполнением настоящего Соглашения, за исключением случаев, когда такая информация:<o:p></o:p></p>
 
<p align="justify" class="MsoListParagraphCxSpFirst"> </p>
 
<ul> 
  <li>
    <div align="justify">является общедоступной;</div>
  </li>
 
  <li>
    <div align="justify">раскрыта по требованию или разрешения Покупателя;</div>
  </li>
 
  <li>
    <div align="justify">требует раскрытия по основаниям, предусмотренным законодательством, или при поступлении соответствующих запросов суда, или уполномоченных государственных органов;</div>
  </li>
 
  <li>
    <div align="justify">раскрыта по иным основаниям, предусмотренным соглашением Сторон.</div>
  </li>
 </ul>
 
<p class="MsoNormal"> 
<a name="Обстоятельства"></a>
 <b>9. Обстоятельства непреодолимой силы</b><o:p></o:p></p>
 
<p align="justify" class="MsoNormal">9.1. Сторона освобождается от ответственности, если неисполнение или ненадлежащее исполнение обязательств было связано с обстоятельствами непреодолимой силы (форс-мажорными обстоятельствами), то есть непредвиденными, чрезвычайными и неотвратимыми при данных условиях обстоятельствами, которые Стороны не могли ни предвидеть, ни предотвратить разумными мерами.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">9.2. В случае наступления обстоятельств непреодолимой силы Интернет-магазин &laquo;Младенец.ру&raquo; ограничивает количество Заказов с возможностью доставки на текущий день.<o:p></o:p></p>
 
<p class="MsoNormal"> 
  <br />
 </p>
 
<p class="MsoNormal"> 
<a name="Прочие условия"></a>
 <b>10. Прочие условия</b><o:p></o:p></p>
 
<p align="justify" class="MsoNormal">10.1. Соглашение является юридически обязывающим договором между Сторонами и содержит правила совершения покупок в Интернет-магазине &laquo;Младенец.ру&raquo;.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">10.2. Совершение покупок в Интернет-магазине &laquo;Младенец.ру&raquo; возможно только на условиях данного Соглашения.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">10.3. Покупатель, совершая покупку в  Интернет-магазине &laquo;Младенец.ру&raquo;,  принимает условия настоящего Соглашения без оговорок и в полном объеме.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">10.4. Признание судом какого-либо положения Соглашения   недействительным и/или не подлежащим исполнению, не влечет недействительности и/или неисполнимости иных положений Соглашения или всего Соглашения в целом.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">10.5. Все споры и разногласия, возникшие или могущие возникнуть из Соглашения, подлежат разрешению путем переговоров на основании письменного заявления Покупателя. Продавец после получения от Покупателя претензии обязан в течение 20 (двадцати) дней удовлетворить заявленные в претензии требования либо отправить Покупателю мотивированный отказ. В случае если возникший спор не будет разрешен в претензионном порядке в течение 60 (шестидесяти) дней, любая из Сторон вправе обратиться за разрешением спора в суд.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">10.6. Бездействие Продавца в случае нарушения Покупателем условий Соглашения, не лишает Продавца права осуществлять защиту своих интересов позднее, а также не означает отказа Продавца от своих прав в случае совершения Покупателем подобных либо сходных нарушений в будущем.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">10.7. При любых обстоятельствах ответственность Продавца ограничена 1 000 (одной тысячью) рублей и возлагается на него при наличии в его действиях вины.<o:p></o:p></p>
 
<p align="justify" style="margin-bottom: 12pt;" class="MsoNormal">10.8. Соглашение может быть изменено Интернет-магазином &laquo;Младенец.ру&raquo; без какого-либо специального уведомления. Новая редакция Соглашения вступает в силу по истечении 3 (трех) дней с момента ее размещения на сайте Интернет-магазина &laquo;Младенец.ру&raquo; по адресу <a href="http://www.mladenec-shop.ru/about/agreement.php" >http://www.mladenec-shop.ru/about/agreement.php</a>, если иное не предусмотрено новой редакцией Соглашения.  <o:p></o:p></p>
 
<p align="justify" class="MsoNormal">10.9. Продавец вправе расторгнуть Соглашение в случае  нарушения Покупателем его условий или по иным основаниям, предусмотренным действующим законодательством РФ.<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">10.10. Для всех действий Сторон, совершаемых  на условиях и во исполнение настоящего Соглашения, время их исполнения устанавливается по московскому времени.<o:p></o:p></p>
 
<p class="MsoNormal"> 
  <br />
 </p>
 
<p class="MsoNormal"> 
<a name="Законодательство"></a>
 <b>11. Законодательство</b><o:p></o:p></p>
 
<p align="justify" class="MsoNormal">Гражданский кодекс Российской Федерации<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">Федеральный закон Российской Федерации &laquo;О защите прав потребителей&raquo;<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">&laquo;Правила продажи Товаров дистанционным способом&raquo;, утвержденные Постановлением  Правительства Российской Федерации  от 27.09.2007 № 612<o:p></o:p></p>
 
<p align="justify" class="MsoNormal">Постановление Правительства Российской Федерации   от 19 января 1998 г. № 55, содержащее в себе:<o:p></o:p></p>
 
<p align="justify" class="MsoListParagraphCxSpFirst"> </p>
 
<ul> 
  <li>
    <div align="justify">Перечень Товаров длительного пользования, на которые не распространяется требование покупателя о безвозмездном предоставлении ему на период ремонта или замены аналогичного Товара;</div>
  </li>
 
  <li>
    <div align="justify">Перечень непродовольственных Товаров надлежащего качества, не подлежащих возврату или обмену на аналогичный Товар других размера, формы, габарита, фасона, расцветки или комплектации.</div>
  </li>
 
  <li>
    <div align="justify">&laquo;Перечень технически сложных Товаров, в отношении которых требования потребителя об их замене подлежат удовлетворению в случае обнаружения в Товарах существенных недостатков&raquo;, утвержденный Постановлением Правительства Российской Федерации от 13 мая 1997 г. № 575.</div>
  </li>
 </ul>
 <o:p></o:p> 
<p></p>
 
<p class="MsoListParagraphCxSpMiddle"><o:p></o:p></p>
 
<div> 
  <div> 
    <div language="JavaScript" class="msocomtxt" id="_com_1"> 
      <p style="background-color: rgb(241, 241, 241);" class="MsoNormal"><span style="font-size: 8pt; font-family: Arial,sans-serif; color: rgb(34, 34, 34);"></span><o:p></o:p></p>
     </div>
   </div>
 </div>
 <?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>