<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Франчайзинг");
?> 
<div class="center_LColonum_Y"> 
  <h2><font color="#f16522">Уважаемые клиенты!!!</font></h2>
 
  <p><font size="4">В связи с наличием большого количества заявок, потенциальные франчайзи будут рассматриваться на открытие в период с августа по октябрь 2012г.</font></p>
 
  <p> Компания Младенец.РУ работает на рынке товаров для новорожденных с ноября 2003 г. </p>
 
  <h4><font color="#f16522" class="Apple-style-span">О нас: </font></h4>
 
  <p> Компания Младенец.ру один из первых интернет-магазинов детских товаров, успешно организовавший свой бизнес на территории Москвы и Московской области. Наш ассортимент более 3000 наименований. Мы представляем самые известные бренды, пользующиеся спросом на территории всей России, такие как: (Gerber, Nestle, Pampers, Libero, Haggies, Mustela, Chicco, Avent и мн. др. ), В том числе и пользующиеся огромной популярностью Японские марки: Merries, Moony, Goo.N, Lion, Center in, Pigeon, Sanko, Wakodo, и.т.д. </p>
 
  <p> Мы предлагаем вам всегда востребованный, высокооборотный товар, с максимальными скидками, а так же возможность его получения из одного источника и новую модель ведения бизнеса с минимальными рисками т.к по оценкам экспертов объем российского рынка детских товаров составляет около 6 &ndash; 7 млрд. $, при этом из них на Москву приходится порядка 1 &ndash; 1,5 млрд. $. Одним из самых значительных и прибыльных сегментов этого рынка являются товары для новорожденных. В Москве, чтобы купить стандартный набор для новорожденного (коляска, кроватка, ползунки, пеленки, бутылочки, памперсы и т.д.) необходимо потратить 1000-1500$</p>
 
  <p><span class="Apple-style-span" style="color: rgb(241, 101, 34); font-weight: bold;">Наши партнеры:</span></p>
 
  <p> На сегодняшний день под нашей маркой открыто и успешно существует 5 магазинов - Франчайзи  в г.Мытищи, г. Королев, г.Юбилейный, г. Москва и г. Подольске, оформленных в корпоративном стиле компании.</p>
 
  <p><a href="http://www.mladenec-shop.ru/contacts/" >КОНТАКТЫ</a> 
    <br />
   </p>
 
  <h4><font color="#f16522" class="Apple-style-span">Требования к помещению:</font></h4>
 
  <p> Отдельный вход, нежилое помещение может располагаться в жилом доме при условии, что вход не сопряжен с жилым подъездом. </p>
 
  <p> Минимальная площадь: 50 кв. м. :торговая площадь + подсобное помещение и склад. </p>
 
  <p> Рекомендуемая: 100 кв. м.: 70кв. м. торговая площадь+30 кв. м.подсобное помещение и склад. </p>
 Наши магазины оформлены в корпоративном стиле компании, для персонала предусмотрена форменная одежда, что поддерживает имидж компании. 
  <p> Для персонала проводятся тренинги и корпоративное обучение, что позволяет поддерживать высокий уровень обслуживания наших клиентов. </p>
 
  <h4><font color="#f16522" class="Apple-style-span">Преимущества:</font></h4>
 
  <ol> 
    <li>Мы предоставляем широкий ассортимент товаров с нашими максимальными скидками от производителей, а также содействие в поставках товаров в Вашем регионе с максимальными скидками наших поставщиков. </li>
   
    <li>Участие в Акциях от производителей на федеральном уровне. 
      <br />
     </li>
   
    <li>возможность выбора ассортиментного перечня исходя из особенностей вашего региона. </li>
   
    <li>Отсутствие паушального взноса. </li>
   
    <li>Отсутствие роялти в первый год сотрудничества. </li>
   
    <li>Относительно невысокие затраты для &quot;старта&quot; </li>
   
    <li>Минимальные риски-товар востребован всегда. </li>
   
    <li>Информирование наших клиентов об открытии магазина в Вашем регионе</li>
   
    <li>Участие в выставках.</li>
   </ol>
 
  <h4><font color="#f16522" class="Apple-style-span">Наша поддержка:</font></h4>
 
  <ol> 
    <li>Подключение к интернет-магазину, техническая поддержка ( в разработке). </li>
   
    <li>Ценообразование.</li>
   
    <li>Ассортиментный перечень высокооборотного товара.</li>
   
    <li>Содействие в продвижении. 
      <br />
     </li>
   
    <li>Консультационная поддержка по оформлению дизайна магазина и оборудования.</li>
   </ol>
 
  <p>Вы заинтересовались? </p>
 Заполните анкету: <a href="/upload/medialibrary/Anketa_fr.docx" >скачать</a> и отправьте на электронную почту  <a href="mailto:franshizа@mladenec.ru" >franshizа@mladenec.ru</a> 
  <br />
 Наши специалисты оперативно рассмотрят Вашу анкету и ответят на интересующие вопросы. 
  <br />
 
  <br />
 </div>
 <?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>