<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Как купить");
?> <div class="center_LColonum_Y">
<h2 class="orange">Режим работы</h2>
<br />
 <b>Оформить заказ на сайте Младенец.РУ Вы можете круглосуточно. </b>
<br /><br />
 <b>Прием заказов по телефону: </b>
<ul class="noMarkerList">
 <li>С понедельника по субботу с 9.00 до 22.00 </li>
 <li>В воскресенье с 10.00 до 21.00. </li>
 <li>Служба доставки работает с понедельника по воскресенье с 14.00 до 22.00.</li> 
</ul>
 
<br />
 <b class="orange">Поиск и выбор нужного товара</font></b>  

<div> 
  <br />
 
  <ul> 
    <li> Для выбора детских товаров в нашем Интернет-магазине Вы можете воспользоваться полным каталогом товаров, расположенном в верхней части экрана. Это основные разделы Интернет-магазина, они отображаются на каждой странице. </li>
   </ul>
 
  <ul> 
    <li> При выборе Вы можете воспользоваться отбором по фильтрам (по производителю, по виду, по названию и т.д.). Список с товарами выбранного Вами раздела появляется в центре сайта. </li>
   </ul>
 
  <ul> 
    <li> Вы можете воспользоваться быстрой формой поиска (под каталогом товаров в верхней части страницы) товара по наименованию. (Предлагаемая поисковая система поможет Вам быстро найти интересующий Вас товар). </li>
   </ul>
   <img hspace="20" height="45" width="402" src="../images/poisk.jpg" title="поиск товара" /> 
  <br />
 
  <br />
<b class="orange">Наличие товара на складе</b>
  <br />
 
  <ul></ul>
 
  <ul type="disc"> 
    <li class="MsoNormal" style="line-height: normal; "><font face="Verdana"><span style="font-size: 12pt; font-family: 'Times New Roman', serif; "></span></font><span style="font-size: 12pt; font-family: 'Times New Roman', serif; "></span>Если напротив цены у интересующего Вас детского товара стоит Уведомить о поставке - это означает, что на данный момент этот товар отсутствует в продаже. Вы можете воспользоваться уведомлением о поставке, нажав на уведомить о поставке и заполнить все данные, во всплывшем окне. Как только товар появится в продаже, Вы получите письмо с уведомлением на Ваш e-mail.</li>
   </ul>
 <img hspace="20" height="86" width="400" title="Уведомить о поставке" src="/images/s.jpg" /> 
  <br />
 
  <ul type="disc"> </ul>
 
  <br />
 
  <br />
 
  <ul type="disc"> </ul>
 
  <ul></ul>
 
  <ul> 
    <li> Вы можете уточнить о наличии товара на складе и оформить заказ, позвонив по указанному на сайте телефону или через службу<a target="_blank" href="http://live01.liveoperator.ru:443/chat/chat.php?site=114&amp;chat=0&amp;rand=1508667115&amp;subject=&amp;charset=windows-1251&amp;cls=vchuikjkini437stngfbfh4e93" > ONLINE-консультация.</a></li>
   </ul>
 </div>
</div>
 <?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>