<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Как купить?");
?> 
<div class="center_LColonum_Y"> 
  <h1><font color="#f16522" class="Apple-style-span">Как купить?</font></h1>
 
  <div class="center_LColonum_Y"><img src="/upload/medialibrary/043/kak_kupit_cxema.jpg" border="0" width="724" height="393"  /></div>

  <br />
 <b><font color="#ff6600">Поиск и выбор нужного товара</font></b>  
  <div> 
    <br />
   
    <ul> 
      <li> Для выбора детских товаров в нашем Интернет-магазине Вы можете воспользоваться полным каталогом товаров, расположенном в верхней части экрана. Это основные разделы Интернет-магазина, они отображаются на каждой странице. </li>
     </ul>
   
    <ul> 
      <li> При выборе Вы можете воспользоваться отбором по фильтрам (по производителю, по виду, по названию и т.д.). Список с товарами выбранного Вами раздела появляется в центре сайта. </li>
     </ul>
   
    <ul> 
      <li> Вы можете воспользоваться быстрой формой поиска (под каталогом товаров в верхней части страницы) товара по наименованию. (Предлагаемая поисковая система поможет Вам быстро найти интересующий Вас товар). </li>
     </ul>
         <img src="/upload/medialibrary/96c/ujsdfw1111.JPG" title="Снимок1111.JPG" border="0" alt="Снимок1111.JPG" width="600"  />  </div>
 
  <ul> 
    <li>Чтобы купить понравившийся Вам товар, необходимо кликнуть на него и Вы окажетесь в карточке товара. Здесь Вы найдете полные данные о товаре: подробное описание, цена, информация о наличии товара на складе, отзывы других покупателей о данном товаре и т.п.</li>
   </ul>
 
  <ul> 
    <li>Если товар Вам подходит измените количество в соответствующем поле, нажмите в правом верхнем углу оранжевую кнопку &quot;Положить в корзину&quot;. Товар окажется в виртуальной корзине.</li>
   </ul>
 
  <ul> 
    <li>Так же вы можете положить товар из списка товаров.</li>
   </ul>
 <img src="/upload/medialibrary/c33/rwaspf123.JPG" title="Снимок123.JPG" border="0" alt="Снимок123.JPG" width="650"  /> 
  <br />
 
  <ul> 
    <ul> 
      <br />
     </ul>
   
    <li><span style="background-color: rgb(255, 255, 255); " class="Apple-style-span">Обратите внимание: в верхнем правом углу расположена корзина, на ней будет отображаться </span><span style="background-color: rgb(255, 255, 255); " class="Apple-style-span">информация о количестве товаров в корзине и их суммарной стоимости.</span></li>
   </ul>
 <img src="/upload/medialibrary/a76/rqvmdy258.JPG" title="Снимок258.JPG" border="0" alt="Снимок258.JPG" width="311" height="141"  /> 
  <br />
 
  <ul> 
    <li><span style="background-color: rgb(255, 255, 255); " class="Apple-style-span">Перейдя в персональный разделел &quot;Корзину&quot;, Вы увидите список товаров, которые Вы поместили в корзину, их количество и сумму, действующие акции и скидки. Здесь же Вы можете изменить количество штук в товаре или в целом удалить товар из корзины.</span></li>
   </ul>
 <img src="/upload/medialibrary/415/nwodfz9638.JPG" title="Снимок9638.JPG" border="0" alt="Снимок9638.JPG" width="660"  /> 
  <br />
 
  <ul> </ul>
 
  <div> 
    <p> </p>
   
    <ul> 
      <li>Тщательно проверьте свой заказ. Если Вы готовы перейти к оформлению заказа, нажмите на кнопку &quot;Перейти к оформлению заказа&quot;</li>
     </ul>
   
    <p></p>
   </div>
 
  <div> <font color="#ff6600"><b>Наличие товара на складе</b></font> 
    <br />
   
    <ul type="disc"> 
      <li class="MsoNormal" style="line-height: normal; "><font><span style="font-size: 12pt; font-family: 'Times New Roman', serif; "></span></font><span style="font-size: 12pt; font-family: 'Times New Roman', serif; "></span>Если напротив цены у интересующего Вас детского товара стоит Уведомить о поставке - это означает, что на данный момент этот товар отсутствует в продаже. Вы можете воспользоваться уведомлением о поставке, нажав на уведомить о поставке и заполнить все данные, во всплывшем окне. Как только товар появится в продаже, Вы получите письмо с уведомлением на Ваш e-mail.</li>
     </ul>
   <img hspace="20" height="86" width="400" src="../../images/s.jpg" title="Уведомить о поставке"  /> 
    <br />
   
    <br />
   
    <br />
   
    <ul> 
      <li> Вы можете уточнить о наличии товара на складе и оформить заказ, позвонив по указанному на сайте телефону 8-495-662-999-4 или через службу Оператор ONLINE </li>
     
      <li>Также Вы можете выбрать товар в наших <a href="http://www.mladenec-shop.ru/contacts/" >стационарных магазинах</a>. 
        <br />
       
        <br />
       
        <br />
       </li>
     </ul>
   </div>
 </div>
 <?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>