<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Оплата");
?>
<h2><font color="&#35;ff6600">Наличный расчет</font></h2>
 Оплата производится наличными курьеру при доставке заказа (по Москве и Подмосковью). Оплата принимается в российских рублях,  строго в соответствии с ценой указанной в товарном чеке. 
<br />
 
<h2><font color="&#35;ff6600">Безналичный расчет</font></h2>
 Интернет-магазин Младенец.ру принимает безналичную оплату от физических и <font color="&#35;ff0000">юридических лиц ???</font> Физические лица - после получения заказа и его фактического формирования Вам высылается счет и квитанция на оплату по электронной почте, которые Вы можете распечатать и оплатить в любом отделении Сбербанка РФ или других банках, оказывающих такие услуги. 
<br />
 
<br />
 
<h2> <font color="&#35;ff6600">Платежная система Yandeх-Деньги</font></h2>
 Для оплаты заказа Вы можете использовать платежную систему Яндекс.Деньги - доступный и безопасный способ платить за товары и услуги через Интернет. Для открытия счета в системе Яндекс.Деньги достаточно зарегистрироваться на сайте. Следующий шаг - внесение денег на счет. Это можно сделать через терминалы, системы денежных переводов, предоплаченные карты, а также банки (в том числе банковские карты) во всех регионах России. Деньги со счета можно в любой момент использовать для расчетов за услуги и покупки через Интернет. Платежи в интернет-магазин Яндекс.Деньгами - мгновенные, без комиссии.  
<br />
 Номер кошелька для перевода оплаты: <strong>41001489607558</strong> 
<h2> <font color="&#35;ff6600">Платежная система WebMoney </font></h2>
 
<br />
 
<h2> <font color="&#35;ff6600">Оплата кредитными картами </font></h2>
 <b><font color="&#35;ff6600">Master Card 
    <br />
   
    <br />
   Visa Card </font></b> 
<br />
 
<br />
 
<br />
 
<br />
 
<br />
 
<br />
<?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>