<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Отдел претензий");
?> <b>Уважаемые покупатели.</b> 
<br />
   
<br />
 Интернет-магазин Младенец.ру - живая развивающаяся компания. Создание данного раздела говорит о том, что мы иногда допускаем ошибки, но уважаем права каждого покупателя, и делаем все возможное для исправления допущенной ошибки. 
<br />
 Если у Вас есть претензия по качеству или составу заказа, если Вы хотите вернуть или обменять товар, просим Вас заполнить <b>Форму претензии</b>: 
<br />
 
<br />
 Дата обращения 
<br />
 Имя* 
<br />
 e-mail* 
<br />
 Телефон* 
<br />
 № заказа* 
<br />
 Описание 
<br />
 претензии* 
<br />
 Ваши предложения 
<br />
 по решению 
<br />
 
<br />
 Каждая претензия рассматривается в индивидуальном порядке. 
<br />
 После получения претензии, с Вами свяжется в течении 1 рабочего дня руководитель Отдела претензий для решения возникшей ситуации. 
<br />
 
<br />
 <a href="http://ozpp.ru/library/norubs/9388/index.html" target="_blank">Закон о защите прав потребителей п.26.1 </a> 
<br />
 
<br />
 <a href="/about/pravila_prodaji.php" target="_blank">Правила продажи товаров дистанционным способом </a><?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>