<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Реклама в магазинах");
?> 
<h1><font class="Apple-style-span" color="#f16522">Реклама в магазинах</font></h1>
 
<div> 
  <br />
 </div>
 
<div><b>
    <br />
  </b></div>

<div><b>Размещение мобильных стендов на территории стационарных магазинов Младенец.РУ </b></div>
 
<div> 
  <br />
 </div>
 
<div>Стоимость размещения в течение 1 месяца: 4000 рублей </div>
 
<div> 
  <br />
 </div>
 
<div><b>Распространение печатной продукции в стационарных магазинах Младенец.РУ </b></div>
 
<div> 
  <br />
 </div>
 
<div> 
  <ul> 
    <li>Размещение печатной продукции и промоматериалов на кассе магазина Стоимость размещения 1 вида в течение 1 месяца: 3000 руб </li>
   </ul>
 
  <ul> 
    <li>Размещение печатной продукции на стойке информации Стоимость размещения 1 вида в течение 1 месяца: 2000 руб </li>
   </ul>
 </div>
 
<div> <b>Проведение промомеропиятий на территории стационарных магазинов Младенец.Ру </b> 
  <br />
 
  <ul> 
    <li>Стоимость размещения 1 промоместа ( 1 промоутер + 1 стойка) в течение 1 дня : 2000 руб</li>
   </ul>
 </div>
 <?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>