<a href="/actions"><img src="/i/kotdog/actions.jpg" alt="Акции и подарки" /></a>

<div id="blocks">
    <div class="dog">
        <i></i>
        <a href="">Корма</a>
        <a href="">Лакомства</a>
        <a href="">Витамины и добавки</a>
        <a href="">Игрушки</a>
        <a href="">Аксессуары для собак</a>
        <a href="">Подробнее</a>
    </div>

    <div class="cat">
        <i></i>
        <a href="">Корма</a>
        <a href="">Лакомства</a>
        <a href="">Витамины и добавки</a>
        <a href="">Игрушки</a>
        <a href="">Аксессуары для собак</a>
        <a href="">Подробнее</a>
    </div>

    <div class="rat">
        <i></i>
        <a href="">Корма</a>
        <a href="">Лакомства</a>
        <a href="">Витамины и добавки</a>
        <a href="">Игрушки</a>
        <a href="">Аксессуары для собак</a>
        <a href="">Подробнее</a>
    </div>

    <div class="fish">
        <i></i>
        <a href="">Корма</a>
        <a href="">Лакомства</a>
        <a href="">Витамины и добавки</a>
        <a href="">Игрушки</a>
        <a href="">Аксессуары для собак</a>
        <a href="">Подробнее</a>
    </div>

    <div class="bird">
        <i></i>
        <a href="">Корма</a>
        <a href="">Лакомства</a>
        <a href="">Витамины и добавки</a>
        <a href="">Игрушки</a>
        <a href="">Аксессуары для собак</a>
        <a href="">Подробнее</a>
    </div>

    <div class="more"><i></i>
        <a href="">Корма</a>
        <a href="">Лакомства</a>
        <a href="">Витамины и добавки</a>
        <a href="">Игрушки</a>
        <a href="">Аксессуары для собак</a>
        <a href="">Подробнее</a>
    </div>
</div>


<div id="seofoot">
	<p>Наш <nobr>Интернет-магазин</nobr> предлагает корм для домашних животных в&nbsp;широком ассортименте по&nbsp;доступным ценам. Здесь Вы&nbsp;сможете онлайн купить качественные товары для животных с&nbsp;доставкой на&nbsp;дом.</p>
	<p>В&nbsp;Вашем доме появился долгожданный питомец? Это замечательно, ведь теперь он&nbsp;будет каждый день радовать Вас своим присутствием. Наши &laquo;четвероногие братья&raquo; способны вдохновлять, поднимать настроение и&nbsp;даже лечить от&nbsp;депрессии. Однако, очень важно осознавать то, что, вместе с&nbsp;его появлением, на&nbsp;Ваши плечи ложится определенная ответственность, ведь за&nbsp;ним необходим правильный уход. Теперь Вы&nbsp;чаще будете наведываться в&nbsp;магазин товаров для животных, чтобы приобрести животный корм, витамины, игрушки и&nbsp;прочие товары для любимцев.</p>
	<p>Конечно&nbsp;же, наш ритм жизни порой не&nbsp;позволяет выделить ни&nbsp;минутки свободного времени. Тем более, если Вы&nbsp;живете в&nbsp;Москве. Порой не&nbsp;хватает сил зайти в&nbsp;супермаркет за&nbsp;продуктами, что уж&nbsp;говорить о&nbsp;том, чтобы купить корма для животных, ведь, чаще всего, качественный корм можно приобрести только в&nbsp;специализированных зоосалонах, а&nbsp;такие часто располагаются далеко от&nbsp;Вашего дома, не&nbsp;правда&nbsp;ли? К&nbsp;счастью, Вас выручит продажа товаров через Интернет, а&nbsp;также доставка товаров для животных на&nbsp;дом. Теперь Ваша задача&nbsp;&mdash; просто зайти на&nbsp;сайт, выбрать и&nbsp;заказать все, что нужно: витамины, игрушки, наполнители и&nbsp;корма для братьев наших меньших. Магазин доставит все необходимое в&nbsp;любую точку Москвы.</p>
	<p>Почему&nbsp;же многие предпочитают выбирать именно <nobr>Интернет-магазины</nobr> кормов для животных? В&nbsp;чем состоят основные преимущества такой продажи товаров для питомцев? Прежде всего, это возможность выбора из&nbsp;широкого ассортимента, а&nbsp;не&nbsp;из&nbsp;того, что осталось в&nbsp;обычном зоомагазине. Вы&nbsp;можете спокойно, не&nbsp;торопясь, изучить состав и&nbsp;всю необходимую информацию о&nbsp;любом товаре, а&nbsp;затем сделать заказ. Кроме того, всем известно, что для каждой породы в&nbsp;разном возрасте необходимо определенное питание, ведь сытый и&nbsp;здоровый питомец всегда будет прекрасно выглядеть и&nbsp;чувствовать себя бодрым.</p>
	<p>Более того, заказывать товары для питомцев в&nbsp;онлайн магазине дешево, по&nbsp;сравнению с&nbsp;обычными зоомагазинами и&nbsp;салонами, как, впрочем, и&nbsp;любую продукцию.</p>
	<p>Доставка кормов для животных &laquo;до&nbsp;двери&raquo;&nbsp;&mdash; это оптимальное решение для тех, у&nbsp;кого зачастую не&nbsp;хватает времени. Вы&nbsp;можете быть уверены, что все товары прибудут в&nbsp;срок по&nbsp;указанному адресу без <nobr>каких-либо</nobr> происшествий.</p>
</div>
