<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Доставка по России");
?> 
<h2><font color="#f16522" class="Apple-style-span">Доставка в города и регионы России</font></h2>
 
<p>После фактического формирования заказа интернет-магазином Младенец.ру, покупателю высылается на е-мейл копия счета и квитанция для оплаты в банке.  
  <br />
 После получения оплаты, отгрузка в транспортную компанию осуществляется в течение 1-3 дней.  
  <br />
 Сумма заказа должна составлять более <strong>2500 руб.</strong></p>
 
<p>Стоимость доставки до места назначения Вы можете рассчитать, выбрав услуги любой транспортной компании из нашего Списка:
  <br />
</p>

<ol>  
  <li><a id="bxid_315837" href="http://www.baikalsr.ru/" target="_blank" >Байкал-Сервис</a></li>
 
  <li><a id="bxid_511078" target="_blank" href="http://www.jde.ru/services/calculator.html" >ЖелДорЭкспедиция</a></li>
 
  <li><a id="bxid_165652" href="http://www.tcnms.ru/tarifi.php" target="_blank" >ВСТ</a></li>
 
  <li><a id="bxid_775432" href="http://www.pecom.ru/ru/" target="_blank" >Первая Экспедиционная Компания</a></li>
 </ol>
 
<p>Если Вы желаете, чтобы доставку осуществила грузовая компания, не входящая в перечень стандартных, укажите, пожалуйста, название и контактные данные компании в Москве в примечании к Вашему заказу. Если условия отправки груза будут приемлемы для нашего магазина, мы с удовольствием отправим Ваш заказ выбранной Вами компанией.</p>
 
<p><strong>Почтовыми компаниями отправка не осуществляется.</strong>  
  <br />
 Оплата  транспортной компании за доставку осуществляется при получении заказа по её тарифам.</p>
 
<p>Просим оплатить заказ в течение 5-х банковских дней. В ином случае наличие заказанных товаров на складе не гарантируется.</p>
 
<p>Отправка Вашего заказа до транспортной компании осуществляется в течение 3-х дней после поступления оплаты на наш расчетный счет. После доставки заказа в транспортную компанию на адрес Вашей электронной почты придет номер накладной на отправку.</p>
 
<p> 
  <br />
 </p>
 <?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>