<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Самовывоз");
?> 
<h2><font color="#f16522" class="Apple-style-span">Самовывоз</font></h2>
 
<div>СФОРМИРОВАННЫЕ ЗАКАЗЫ В СТАЦИОНАРНЫЕ МАГАЗИНЫ ДОСТАВЛЯЮТСЯ ПО ГРАФИКУ. ПО ДАТЕ ДОСТАВКИ ВАШЕГО ЗАКАЗА В МАГАЗИН УТОЧНЯЙТЕ У МЕНЕДЖЕРОВ НАШЕГО CALL-ЦЕНТРА.</div>
 
<p>Если Вам удобно самостоятельно забрать заказ, Вы можете выбрать этот способ доставки. Сформированный заказ Вы можете осмотреть и оплатить в наших стационарных магазинах:</p>
 
<p></p>
 
<div>М.О. г. Мытищи, ул.Шараповская, д.1 корп.2  Тел.: +7 (495) 972-22-11 Часы работы: Пн-Вс с 10:00 до 20:30</div>
 
<div><span style="background-color: rgb(227, 237, 196);" class="Apple-style-span"> 
    <br />
   </span></div>
М.О. г. Королев ул.Декабристов, д.20  Тел.: +7 (495) 519-53-24 Часы работы: Пн-Вс с 10:00 до 20:30 
<div> 
  <div> 
    <br />
   </div>
 
  <div>М.О. г. Юбилейный, ул. Лесная, д.14 Тел.: +7 (495) 515-93-80 Часы работы: Пн-Вс с 10:00 до 20:30</div>
 </div>
 
<p></p>
 
<p></p>
 
<p>Режим работы магазинов: Каждый день без выходных, с 10.00 до 20.30.</p>
 
<p>Разместив заказ на сайте или оформив его по телефону, уточните наличие заказа, перед тем, как Вы решили подъехать к нам в магазин.</p>
 <?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>