<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Возврат и обмен");
?> 
<h2><font color="#f16522">Обмен, возврат, брак.</font></h2>
 
<p class="MsoNormal" style="margin-bottom: 12pt;">Обмен и возврат товара производится в соответствии с нормами действующего Закона о защите прав потребителя. Вы можете отказаться от товара до его поставки или в момент фактического его получения, а также имеете право вернуть не подошедший Вам товар в течение 7 дней после покупки при соблюдении следующих условий:<o:p></o:p></p>
 
<p class="MsoNormal" style="margin-bottom: 0.0001pt;"><font color="#f16522">Условия возврата, обмена:</font></p>
 
<ul> 
  <li>Сохранность упаковки и всей сопроводительной документации;</li>
 
  <li>Не нарушены правила пользования товаром;</li>

  <li>Детали в коробке сложены так, как это делает производитель.</li>
 </ul>
 Обмен/возврат технически сложных товаров (радионяни, видеоняни, весы и т.д.) возможен, но производится только после проведения экспертизы сервисного центра. Интернет-магазин &laquo;mladenec-shop.ru&raquo; не несет ответственности за возможный отказ и/или уклонение от гарантийных обязательств изготовителем.  
<div> 
  <ul> 
    <li>собранная мебель возврату и обмену не подлежит</li>
   
    <li>автокресла и коляски, бывшие в употреблении, возврату и обмену не подлежат</li>
  </ul>
 
  <p>При отсутствии таких деталей на складе мы закажем их у производителя. По браку и некомплекту других видов товаров вопрос решается индивидуально с менеджером.</p>
 
  <p> </p>
 
  <p>Для принятия решения о возврате бракованного товара необходимо написать заявление (образец ниже), приложить фотографию бракованного изделия (узла, детали) и выслать их на адрес электронной почты:</p>
 <a href="mailto:manager@mladenec.ru" >manager@mladenec.ru</a> 
  <br />
 
  <br />
  <span style="color: rgb(241, 101, 34);">Обмен и возврат: </span> 
  <br />
 <span style="text-align: left;"> 
    <br />
   </span> 
  <div><span style="text-align: left;">Если Вы хотите обменять товар на другой, имеющийся в наличии, то Вы можете бесплатно обменять товар на складе или вызвать курьера на дом &ndash; по расценкам раздела &laquo;Доставка&raquo;. Каждый случай рассматривается менеджером индивидуально и возможен при условии полной сохранности документов, упаковки и отсутствия следов эксплуатации, а по товарам из категории товаров, обмен и возврат по которым не производится (см. ниже)&ndash;  не возможен. </span>  
    <div><span style="text-align: left;">Брак. Возврат денежных средств за технически сложные устройства (в гарантийный период) осуществляется только после проведения экспертизы сервисного центра и при наличии заключения о производственном браке. Если вы обнаружили брак или некомплект мебельного набора, мы заменим или довезем их при условии наличия у нас на складе, и бесплатно доставим Вам их на дом. При отсутствии таких деталей на складе мы закажем их у производителя. По браку и некомплекту других видов товаров вопрос решается индивидуально с менеджером. 
        <br />
       </span> 
      <p>Возврат товаров принимается только в магазине по адресу:<a href="http://www.mladenec-shop.ru/contacts/" target="_blank" > г. Мытищи, ул. Шараповская, д.1 корп.2.</a></p>
     По желанию покупателя предоставляются услуги курьера для возврата товара на платной основе, согласно условиям, опубликованным на сайте в разделе &quot;Доставка&quot;. 
      <br />
     </div>
   
    <div><span style="color: rgb(241, 101, 34);"> 
        <br />
       </span></div>
   
    <div><span style="color: rgb(241, 101, 34);">Важная информация по мебели:</span></div>
   
    <div> 
      <br />
     </div>
   
    <div>Оттенки цвета одного наименования разных производителей мебели, зачастую не совпадают, даже цвета мебели одного производителя, но разных производственных партий, могут отличаться. Также иногда детали одного набора мебели (как правило, из массива дерева) могут немного отличаться. По информации производителей- это не является браком и связано с партией дерева из которой изготовлена та или иная деталь мебели. 
      <p class="MsoListParagraphCxSpFirst" style="margin-bottom: 0.0001pt;"><o:p></o:p></p>
     
      <p class="MsoListParagraphCxSpLast" style="margin-bottom: 0.0001pt;">Производители постоянно, с целью улучшения потребительских свойств товара, изменяют комплектацию и функционал мебели, таким образом, возможны незначительные изменения в конструкции, что не может быть предметом претензии. Качество мебели российского производства постоянно улучшается и уже практически не уступает импортным образцам, а в чем-то и превосходит. Пожалуйста, помните о том, что надежность, удобство и долговечность использования мебели напрямую зависят от качества ее сборки.<o:p></o:p></p>
     
      <p class="MsoNormal" style="margin-bottom: 0.0001pt;"> 
        <br />
       Обращаем Ваше внимание на то, что при приобретении товаров дистанционным способом в интернет-магазине невозможно увидеть и оценить все достоинства и недостатки того или иного товара. Мы прикладываем все усилия, чтобы предоставить Вам всю информацию о внешнем виде и характеристиках товара. Если Вы сомневаетесь, подходит ли Вам тот или иной товар, его цветовая гамма, функции или характеристики, рекомендуем посмотреть товар &quot;вживую&quot;, почитать отзывы о нем, после чего сделать заказ. 
        <br />
       
        <br />
       <o:p></o:p></p>
     
      <p class="MsoNormal" style="margin-bottom: 0.0001pt;"><font color="#f16522">Мы гарантируем Вам, что Вы приобретаете только новые товары.</font></p>
     
      <p class="MsoNormal" style="margin-bottom: 0.0001pt;"><a href="/upload/medialibrary/Zayavlenie_na_vozvrat.docx" >Образец заявления на обмен или возврат товара</a><a href="#93703179255322" ><font color="#f16522"></font></a><font color="#f16522"><a> </a> </font></p>
     
      <p style="margin: 12pt 0cm 0.0001pt;"><a href="http://www.consultant.ru/online/base/?req=doc;base=LAW;n=84302;p=2#p555" target="_blank" >ПЕРЕЧЕНЬ НЕПРОДОВОЛЬСТВЕННЫХ ТОВАРОВ НАДЛЕЖАЩЕГО КАЧЕСТВА, НЕ ПОДЛЕЖАЩИХ ВОЗВРАТУ ИЛИ ОБМЕНУ НА АНАЛОГИЧНЫЙ ТОВАР ДРУГИХ РАЗМЕРА, ФОРМЫ, ГАБАРИТА, ФАСОНА, РАСЦВЕТКИ ИЛИ КОМПЛЕКТАЦИИ</a></p>
     </div>
   </div>
 </div>
 <?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>