<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Дарья Селезнева");
?> 
<h1>Хроника акции</h1>
 
<table width="296" height="213"> 
  <tbody> 
    <tr> <td align="left" colspan="2" style="border-image: none;"> 
        <h2>Дарья Селезнева, 13 лет</h2>
       </td><td valign="top" style="border-image: none;"> 
        <br />
       </td> </tr>
   
    <tr> <td style="border-image: none;"> 
        <div><img alt="Дарья Селезнева" src="http://www.1mlrdrub.ru/image/children/339.jpg"  /></div>
       </td> <td style="border-image: none;"> 
        <br />
       </td><td valign="top" style="border-image: none;"> 
        <br />
       </td> </tr>
   </tbody>
 </table>
 
<p align="justify">   Уважаемые клиенты Младенец.РУ! До сего времени мы оказывали помощь, в основном, Детским домам товарами нашего ассортимента. И уже распределили более 2 300 000 рублей. Сейчас мы попытаемся оказать адресную помощь хорошей девочке Дарье Селезневой. К сожалению, реабилитация по закону по ее травме производится с 14 лет, а Даше 13. Время дорого. После изучения рынка таких услуг - единственный выход <a href="http://www.three-sisters.ru/contacts/" target="_blank" >ЦЕНТР &quot;ТРИ СЕСТРЫ&quot;</a>. МЫ надеемся с Ващей помощью - вместе с нами достичь результата и вернуть Дашу к полноценной жизни.</p>
 
<p align="justify"><hr/></p>
 
<div><strong>           <u>Адрес:</u></strong> Тульская область, г. Донской. 
  <br />
 
  <br />
 </div>
 
<div><strong>           <u>Клинический диагноз:</u></strong> сочетанная травма: закрытая черепно-мозговая травма и осложненный компрессионно-оскольчатый перелом тела Th12 позвоночника. Грудная миелопатия, нижняя параплегия, нарушение функции тазовых органов. 
  <br />
 
  <br />
 </div>
 
<div><strong>           <u>Показано:</u></strong> проведение реабилитации в специализированном центре <a href="http://www.three-sisters.ru/contacts/" target="_blank" >&quot;ТРИ СЕСТРЫ&quot;</a>. 
  <br />
 
  <br />
 </div>
 
<div><strong>           <u>Необходимо:</u></strong> 450 000 руб. 
  <br />
 
  <br />
 </div>
            Ранее было собрано с помощью других сайтов: 121<span> 538</span> руб. из 450 000 р. 
<br />
 
<br />
            <b>Компания Младенец.РУ к этой сумме собранных ранее средств пожертвовала 50 000 руб.</b> 
<br />
 
<br />
 <hr/> 
<br />
     <font color="#F16522"><b>С 25.09.2012 г. все средства на благотворительность, перечисляемые покупателями при покупке в интернет-магазине Младенец.РУ, будут перечислены на лечение Дарье Селезнёвой. 
    <br />
   
    <br />
   </b></font><hr/> 
<h3> </h3>
 
<h3><font color="#00AEEF">ВСЕГО НЕОБХОДИМО: 450 000 руб.</font></h3>
 
<h4>Собрано* (на 10.10.2012 г.):</h4>
 
<p> </p>
 
<table cellspacing="0" cellpadding="0" border="0"> 
  <tbody> 
    <tr> <td width="671" valign="top" style="border-image: none;"> 
        <p><b>   1. Со всех ящиков проекта с помощью </b><b><a target="_blank" href="http://www.sbornet.ru" >www.sbornet.ru</a></b><b><a target="_blank" href="http://www.blagobox.ru" ></a> собрано: 
            <br />
                  (Сбор средств также ведется на сайте (</b><a href="http://www.blagobox.ru/" >www.blagobox.ru</a><b><a target="_blank" href="http://www.sbornet.ru" ></a>)</b></p>
       </td> <td width="127" valign="top" style="border-image: none;"> 
        <p><b>235<span></span> 616руб.</b></p>
       </td> </tr>
   
    <tr> <td width="671" valign="top" style="border-image: none;"> 
        <p><b>   2. Собственные средства Младенец.РУ:</b></p>
       </td> <td width="127" valign="top" style="border-image: none;"> 
        <p><b>50 000 руб.</b></p>
       </td> </tr>
   
    <tr> <td width="671" valign="top" style="border-image: none;"> 
        <p><b>   3. Средства клиентов Младенец.РУ:</b></p>
       </td> <td width="127" valign="top" style="border-image: none;"> 
        <p><b>109 036 руб.</b></p>
       </td> </tr>
   </tbody>
 </table>
 
<p> </p>
 
<h4><font color="#00AEEF">Итого ОСТАЛОСЬ: 55 348 руб.</font><hr/>*Данные будут обновляться один раз в неделю.</h4>
 
<br />
 <em> </em> 
<h3 align="justify">Подробнее о Даше:   
  <br />
 </h3>
 
<br />
 
<div align="justify">    15 мая стало для 13-летней Даши Селезневой из г. Донской Тульской области страшным днем. Играя с друзьями, девочка упала с качелей. В бессознательном состоянии ее доставили в районную больницу. Врачи выявили закрытую черепно-мозговую травму и, что еще более страшно, &ndash; сложный перелом одного из грудных позвонков. В результате оказались нарушенными функции тазовых органов. Так совершенно здоровый ребенок в одночасье стал практически обездвиженным инвалидом. </div>
 
<p align="justify">   Дашу прооперировали в Центральном институте травматологии и ортопедии им. Н.Н. Приорова. С этого момента для нее началась борьба за возвращение к нормальной жизни. У девочки восстановились функции тазовых органов и стали работать некоторые мышцы ног, в частности, сгибаться стопы. С большим трудом девочка стала самостоятельно садиться на кровати. Однако ей необходимо постоянно носить специальный корсет, ограничивающий движения.</p>
 
<p align="justify">   Для активной и жизнерадостной Даши &ndash; это сущая мука. Она с семи лет занимается в танцевальной студии &laquo;Радость&raquo; и уже успела занять призовое место на межгородском конкурсе танцев. Даша хорошо рисует, особенно ей удаются элементы одежды &ndash; девочка мечтает стать модельером.</p>
 
<p align="justify">   А еще Даша отличается добротой. Несколько лет назад семья Селезневых отдыхала за городом на берегу пруда. Даша не умела плавать и поэтому под присмотром папы прыгала с пристани в воду со спасательным жилетом. В это время местные мальчишки решили утопить в пруду новорожденного котенка. Когда девочка увидела, что маленький серый комочек еле барахтается в воде, она, не раздумывая и без жилета, бросилась его спасать. Тут подоспел папа и вытащил обоих на берег. Так в семье Селезневых появился кот Марсик.</p>
 
<p align="justify">   Даша не только с удовольствием учится сама &ndash; закончила 6 класс на &laquo;хорошо&raquo; и &laquo;отлично&raquo;, &ndash; но и готовит шестилетнего братишку Матвея к школе.</p>
 
<p align="justify">   Но все это &ndash; в прошлом. Сейчас Даша продолжает бороться за свое будущее. Она уже встает, правда, с посторонней поддержкой, и учится самостоятельно ходить с помощью ходунков. Но девочке крайне необходима реабилитация в специализированном восстановительном центре. Стоимость лечения составляет 450 000 рублей. Таких денег у семьи Селезневых, в которой работает одна мама, к сожалению, нет.</p>
 
<p align="justify">   С бедой Даше будет легче справиться, если рядом окажутся чуткие, отзывчивые люди. Сегодня каждый может помочь вернуть Даше здоровье, оказав ей финансовую помощь. 
  <br />
 
  <br />
 </p>
 
<h3>Из письма:</h3>
 
<div><em> 
    <br />
   &laquo;Мы очень верим, что Даша будет ходить, как прежде! Но мы нуждаемся в вашей помощи и очень надеемся на нее&raquo;.</em></div>
 
<div> 
  <h3><em> 
      <br />
     </em></h3>
 </div>
 
<div> 
  <h3><b>СОБРАННЫЕ СРЕДСТВА ПОСТУПЯТ НАПРЯМУЮ В ЦЕНТР РЕАБИЛИТАЦИИ &quot;ТРИ СЕСТРЫ&quot; ПО БЕЗНАЛИЧНОМУ РАСЧЕТУ - ССЫЛКА НА ПЛАТЕЖНОЕ ПОРУЧЕНИЕ БУДЕТ ОПУБЛИКОВАНА ПОЗЖЕ НА ЭТОЙ ЖЕ СТРАНИЦЕ.   </b></h3>
 <em> 
    <br />
   </em></div>
 
<h3>Дополнительные документы и информация: </h3>
 
<ul> 
  <li>Лечение Даши Селезнёвой будет после сбора средств проводиться в Центре реабилитации &quot;Три сестры&quot;</li>
 
  <li>Контакты мамы Даши Селезнёвой, Елены Каменевой: 
    <br />
   тел.  8-905-117-94-85 
    <br />
   e-mail: <a href="mailto:kamneva.elena2012@yandex.ru" >kamneva.elena2012@yandex.ru</a></li>
 </ul>
 
<p>Даша, ее семья будут сердечно благодарны всем, кто окажет помощь.</p>
 
<p>Мама Даши Селезнёвой, Елена Каменева, рада помощи нашей компании и не возражает против сбора средств на лечение дочери: 
  <br />
 </p>
 
<p><i>Я Елена Каменева, не возражаю против проведения акции по сбору средств на лечение моей дочери Дарии Селезневой.</i> 
  <br />
 <b><i> </i> </b></p>
 
<h3><b> 
    <br />
   </b></h3>
 
<h3> </h3>
 
<h3> </h3>
 <?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>